# Pandas -- getting started

## 1   
Read the file purchases_more.csv

Give a statement that removes duplicate rows. Then show the number of null values for each column.

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("purchases_more.csv")

In [4]:
df.head(5)

      names  gender       education  apples  oranges  pears  kiwis
0   Abigail  female          Master       2      2.0    9.0      9
1    Amelia  female          Master       2      2.0    3.0      2
2       Ava  female  Post secondary       1      8.0    7.0      4
3     Avery  female  Post secondary       2      1.0    1.0      3
4  Benjamin    male          Master       9      9.0    6.0      7

In [4]:
# Check the number of rows and columns
df.shape

(36, 7)

In [5]:
df.drop_duplicates(inplace = True)

In [6]:
# Check again to make sure that the duplicates have been removed
df.shape

(30, 7)

In [7]:
df.isna().sum()

names        0
gender       0
education    0
apples       0
oranges      2
pears        4
kiwis        0
dtype: int64

## 2
For each column, replace each null value with the average value for that column.

In [8]:
df = df.fillna(df.mean())

In [9]:
df.head(10)

       names  gender       education  apples  oranges  pears  kiwis
0    Abigail  female          Master       2      2.0    9.0      9
1     Amelia  female          Master       2      2.0    3.0      2
2        Ava  female  Post secondary       1      8.0    7.0      4
3      Avery  female  Post secondary       2      1.0    1.0      3
4   Benjamin    male          Master       9      9.0    6.0      7
5  Charlotte  female          Master       3      8.0    3.0      9
6      David    male        Bachelor       1      2.0    4.0      0
7     Elijah    male          Master       8      9.0    4.0      8
8  Elizabeth  female          Master       2      4.0    3.0      6
9       Ella  female          Master       3      9.0    8.0      6

## 3
Select all rows where more than 3 apples were purchased.

In [10]:
df[df["apples"] > 3]

       names  gender education  apples  oranges  pears  kiwis
4   Benjamin    male    Master       9      9.0    6.0      7
7     Elijah    male    Master       8      9.0    4.0      8
10     Emily  female    Master       9      9.0    9.0      1
11      Emma  female  Doctoral       4      2.0    7.0      5
12    Evelyn  female    Master       9      0.0    4.0      1
13    Harper  female  Bachelor       8      8.0    5.0      8
14  Isabella  female    Master       5      9.0    4.0      0
15     James    male    Master       5      0.0    5.0      7
19     Lucas    male    Master       6      7.0    6.0      5
27     Sofia  female  Bachelor       4      4.0    4.0      7
28    Sophia  female  Bachelor       4      8.0    8.0      3

## 4
Select those rows where more apples than pears were purchased.

In [11]:
df[df["apples"] > df["pears"]]

       names  gender       education  apples   oranges  pears  kiwis
3      Avery  female  Post secondary       2  1.000000    1.0      3
4   Benjamin    male          Master       9  9.000000    6.0      7
7     Elijah    male          Master       8  9.000000    4.0      8
12    Evelyn  female          Master       9  0.000000    4.0      1
13    Harper  female        Bachelor       8  8.000000    5.0      8
14  Isabella  female          Master       5  9.000000    4.0      0
21       Mia  female          Master       1  5.178571    0.0      6
23      Noah    male          Master       3  5.000000    0.0      4

## 5
Read the file, IMDB-Movie-Data.csvPreview the document Show the number of rows and columns.

In [12]:
df2 = pd.read_csv("IMDB-Movie-Data.csv")
# Show the number of rows and columns
df2.shape

(1000, 12)

## 6
Select the movies that were released between 2010 and 2013, have a rating above 8.5, and have revenue above the 75th percentile.

In [22]:
df2[
    ((df2['Year'] >= 2010) & (df2['Year'] <= 2013))
    & (df2['Rating'] > 8.5)
    & (df2["Revenue (Millions)"] > df2["Revenue (Millions)"].quantile(0.25))
]

,Rank,Title,Genre,Description,Director,Actors,Year,Runtime (Minutes),Rating,Votes,Revenue (Millions),Metascore
80,81,Inception,"Action,Adventure,Sci-Fi","A thief, who steals corporate secrets through ...",Christopher Nolan,"Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen...",2010,148,8.8,1583625,292.57,74.0

## 7
How many unique directors are there in this data?

In [14]:
len(df2["Director"].unique())

644

## 8
Which director has directed the most movies?

In [15]:
df2["Director"].value_counts()

Ridley Scott          8
Paul W.S. Anderson    6
Michael Bay           6
M. Night Shyamalan    6
David Yates           6
                     ..
Simon Curtis          1
Neil Marshall         1
Kirsten Sheridan      1
Mira Nair             1
Michael Spierig       1
Name: Director, Length: 644, dtype: int64

## 9
Produce a dataframe consisting of the director, and the average rating for all the films with that director.

In [23]:
# Make a new DataFrame with Director and Rating
df3 = df2[["Director","Rating"]]
# Group the new DataFrame by director
df3 = df3.groupby("Director").mean().reset_index()

In [24]:
df3.head()

              Director  Rating
0           Aamir Khan     8.5
1  Abdellatif Kechiche     7.8
2            Adam Leon     6.5
3           Adam McKay     7.0
4        Adam Shankman     6.3

## 10
Show the top ten directors sorted by rating

In [25]:
df4 = df3.sort_values(by = "Rating", ascending = False)

In [26]:
df4.head()

                             Director  Rating
465                     Nitesh Tiwari    8.80
108                 Christopher Nolan    8.68
392                    Makoto Shinkai    8.60
470                   Olivier Nakache    8.60
194  Florian Henckel von Donnersmarck    8.50

Make sure to submit your answers by uploading a Jupyter notebook. If your submission is within three days of the activity session, we will provide your with written feedback.